{"id":592,"date":"2023-07-31T10:19:04","date_gmt":"2023-07-31T10:19:04","guid":{"rendered":"https:\/\/edisonrealestatebd.com\/blog\/?p=592"},"modified":"2023-07-31T10:28:04","modified_gmt":"2023-07-31T10:28:04","slug":"interest-rate-ceiling-on-home-loans-need-of-the-hour","status":"publish","type":"post","link":"https:\/\/edisonrealestatebd.com\/blog\/interest-rate-ceiling-on-home-loans-need-of-the-hour\/","title":{"rendered":"Interest Rate Ceiling On Home Loans Need Of The Hour"},"content":{"rendered":"\n<p><strong>In an exclusive interview with The Business Standard, Md Aminur Rashid, chairman of Edison Real Estate, discusses the luxury apartment market in the country and the future of the real estate industry<\/strong><\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"686\" height=\"386\" src=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/07\/for_web_edison_chairman_md_aminur_rashid.jpg\" alt=\"\" class=\"wp-image-593\" srcset=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/07\/for_web_edison_chairman_md_aminur_rashid.jpg 686w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/07\/for_web_edison_chairman_md_aminur_rashid-300x169.jpg 300w\" sizes=\"(max-width: 686px) 100vw, 686px\" \/><\/figure><\/div>\n\n\n<p><strong>Aesthetic abodes are gaining popularity in the capital and Edison Real Estate is contributing a lot to that. What kind of policy support do you think is needed to promote artistic endeavours in home-building?<\/strong><\/p>\n\n\n\n<p>Since its inception, Edison emphasised enhancing customers&#8217; lifestyles through innovation and value creation. Each of our apartments are spacious, well-ventilated, highly-functional, and accompanied with sumptuous amenities of the complex. These are the components contributing to aesthetically pleasant living conditions, with a touch of nature and evoking a sentiment of tranquillity and wellbeing.<\/p>\n\n\n\n<p>We believe Dhaka and its citizens are craving this new trend. Edison Real Estate is already working to address this demand, and you can see our footprints of such style across the capital.<br><br>However, more dynamic and developer-friendly policies need to be enacted so that the end-users and all stakeholders can be benefitted. Despite the land scarcity, supply chain issue, material price hike, and regulatory problems, many of our experienced developers are doing remarkably well in both residential and commercial enclaves compared to global standards. <\/p>\n\n\n\n<p>The real estate industry and its verticals are contributing to almost 8% of the GDP. If government bodies help us, more of such aesthetic apartments can be constructed for the burgeoning middle class at affordable prices; not only limiting them to the affluent class and certain areas, rather spreading them throughout the city.<\/p>\n\n\n\n<p><strong>What more can be done to make the city greener, cleaner, safer and more liveable?<\/strong><\/p>\n\n\n\n<p>We have to address the problem of skyrocketing population in Dhaka as well making the streets and neighbourhoods safe for all — a city where everyone can coexist in serenity. We need to quickly execute the commuting projects so that connectivity issues are resolved soon. This will reduce carbon emission, and save time and money for everyone.&nbsp;<\/p>\n\n\n\n<p>Large-scale exclusive residential areas need to be developed and promoted, like Bashundhara R\/A, Purbachal, Jalshiri, and Uttara. Some outskirts like Keraniganj, nearby areas of Mawa, and Savar need to be addressed too. When daily amenities will be available in the above-mentioned areas, population density will reduce in the capital. Then we can gradually change the landscape of the capital, making space for more functional areas as well as modern residences for all.<\/p>\n\n\n\n<p><strong>Withdrawal of interest rate cap will make home loans costlier. How can banks or leasing companies help prospective home buyers in this regard?<\/strong><\/p>\n\n\n\n<p>The interest rate has crossed double digit in cases of several financial institutions. The total cost of managing funds to purchase an apartment is getting costlier too as registration and related costs have increased. Potential customers are struggling to cope up with this; as a result, developers are facing shortages in revenue. Apartment buyers are waiting and observing the situation. This will slow things down and it will take quite a bit of time for the scenario to stabilise.<\/p>\n\n\n\n<p>The ceiling of interest rate on home loans needs to be reestablished without any delay. The developers and banks, NBFIs and other leasing entities need to increase collaboration so that it benefits the home buyers and their business as well.<\/p>\n\n\n\n<p><strong>How is the new DAP 2022-35 different from the previous one? What is your opinion regarding the floor area ratio (FAR) guidelines in the new DAP?<\/strong><\/p>\n\n\n\n<p>The new Detailed Area Plan 2022-35 is being reviewed at the moment. It will be good news for the whole industry and apartment buyers because the proposed DAP was challenging for providing housing to all in Dhaka, both in terms of space and cost.&nbsp;<\/p>\n\n\n\n<p>We want to express our deepest gratitude to all who are involved to revise the plan. This is going to encourage all developers. We know that the formal private sector of the housing industry is still enhancing its capacity to address the total housing demand of the country. So this review is going to be a blessing for all. <\/p>\n\n\n\n<p><strong>What does Edison hope to achieve in the near future?<\/strong><\/p>\n\n\n\n<p>Edison Real Estate aims to become the most trusted and respected real estate company in Bangladesh by improving the standard of living of our customers and making them happy.<\/p>\n\n\n\n<p>Infusing biophilic and elegant design, modern amenities, cutting-edge technologies, best-in-class materials, total quality control, timely execution, and unparalleled services, we try to maximise customers&#8217; value. The sumptuous amenities of our creations ensure that customers&#8217; upscale living standard is not limited to certain square feet of three or four-bedroom apartments.<\/p>\n\n\n\n<p>As we develop our projects in owned lands, we offer optimum value for luxury so that life is celebrated to its fullest at these dream homes. Our customer-centric approaches, innovation, and financial strength have made us the largest developer in Bashundhara R\/A in less than three years of operation there. This has enabled us to expand our horizon across the country and address customers&#8217; growing demand for improvised residences. More than 300 customers have chosen us within the last two and half years.<\/p>\n\n\n\n<p>Despite the scarcity of space in this densely populated capital, we are working on large areas of land. Edison Real Estate is developing 1,000 apartments over 500 katha of land in the capital. Our average land size is almost 20 katha per project.<\/p>\n\n\n\n<p>We are now eying in Jalshiri Abashon, Uttara and several major neighbourhoods in Dhaka and Chattogram. Some magnificent projects are going to be initiated in these areas within the next year. We want to replicate our success story of Bashundhara R\/A in those areas. This will help us achieve our business goals. We firmly believe we can do that and contribute to the evolving industry.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In an exclusive interview with The Business Standard, Md Aminur Rashid, chairman of Edison Real Estate, discusses the luxury apartment market in the country and the future of the real estate industry Aesthetic abodes are gaining popularity in the capital and Edison Real Estate is contributing a lot to that. What kind of policy support [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":597,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[8],"tags":[],"_links":{"self":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/592"}],"collection":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/comments?post=592"}],"version-history":[{"count":2,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/592\/revisions"}],"predecessor-version":[{"id":596,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/592\/revisions\/596"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/media\/597"}],"wp:attachment":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/media?parent=592"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/categories?post=592"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/tags?post=592"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}