{"id":606,"date":"2023-09-11T04:45:53","date_gmt":"2023-09-11T04:45:53","guid":{"rendered":"https:\/\/edisonrealestatebd.com\/blog\/?p=606"},"modified":"2023-10-25T07:14:15","modified_gmt":"2023-10-25T07:14:15","slug":"the-lakeside-dreams-by-edison-real-estate","status":"publish","type":"post","link":"https:\/\/edisonrealestatebd.com\/blog\/the-lakeside-dreams-by-edison-real-estate\/","title":{"rendered":"The Lakeside Dreams by Edison Real Estate"},"content":{"rendered":"\n<p>Dhaka — the city of millions. Here, years of mismanagement and uncontrolled population growth have resulted in an unplanned and unregulated housing system. However, amidst this chaos, a beacon of hope emerged in 2015 when Edison Real Estate started its journey.&nbsp;<\/p>\n\n\n\n<p>Within a few years, Edison has gained the trust of people, becoming the largest real estate developer in Bashundhara R\/A. With modern amenities, exquisite design, and biophilic architecture, Edison Real Estate is crafting a shaded dream abode within the heart of Dhaka.&nbsp;<\/p>\n\n\n\n<p>Edison Valeria, Edison Viola, and Edison Hermia are three prestigious luxury residences that grace the landscape of Dhaka. These exceptional projects share a common feature — they are nestled along the tranquil banks of a charming lake. Let us have a journey through the projects.&nbsp;<br><\/p>\n\n\n\n<p><strong>Edison Valeria<\/strong><\/p>\n\n\n\n<p>Imagine yourself sitting on the balcony during the tranquil evening, with a warm cup of coffee. The mesmerising water of the lake, mirroring the breathtaking hues of the seven-coloured sky. As you breathe, a sense of life and serenity embraces you, creating an ethereal experience of living. All of these will happen at Edison Valeria.&nbsp;&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"985\" height=\"1024\" src=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/05.Render-1-985x1024.jpg\" alt=\"\" class=\"wp-image-608\" srcset=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/05.Render-1-985x1024.jpg 985w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/05.Render-1-288x300.jpg 288w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/05.Render-1-768x799.jpg 768w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/05.Render-1.jpg 1200w\" sizes=\"(max-width: 985px) 100vw, 985px\" \/><\/figure>\n\n\n\n<p><br>This dream project, nestled on 13.24 katha land, is located at M block of Bashundhara R\/A, just by the side of a lake. With a 25-feet-wide road right in front of the building, it is conveniently situated near the proposed 200-feet-wide DAP link road. At M block, only 140 plots among 4,650 are lakeside ones. Only a few of them are above 10 katha with all three sides open. Valeria is one of them.&nbsp;<\/p>\n\n\n\n<p>Valeria has 26 apartments, each occupying 1,875 to 2,175 square feet, of three bedrooms each. Each apartment features two bedrooms, offering a captivating view of the lake, complemented by balconies.<\/p>\n\n\n\n<p>The architectural marvel greets you with a double-height entry and a beautifully furnished lobby, setting the tone for luxury and elegance. As you step into the building, two elevators smoothly whisk you away to your home. The parking area offers a total of 26 parking spaces.<\/p>\n\n\n\n<p>The rooftop has a serene seating area and a barbeque zone, perfect for leisure and celebration. For the health-conscious, there is a well-equipped gym with changing facilities. But the true attraction of Valeria lies in its vast green area, spanning almost 4,700 square feet, offering you a constant connection to nature. The project is set to be handed over in 2026. Embrace the allure of Edison Valeria, where modernity meets nature&#8217;s embrace.&nbsp;<\/p>\n\n\n\n<p>To know more about this lakeside beauty, click:&nbsp;<a href=\"https:\/\/edisonrealestatebd.com\/projects\/edison-Valeria\">https:\/\/edisonrealestatebd.com\/projects\/edison-Valeria<\/a><br><\/p>\n\n\n\n<p><strong>Edison Viola<\/strong><\/p>\n\n\n\n<p>Imagine the western sky is covered with black clouds. Suddenly it starts raining. The smell of the clay carries your soul away to a distant childhood. Edison Viola, the new project of Edison Real Estate, will make this dreamlike moment an integral part of your life.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"687\" height=\"763\" src=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/viola.jpg\" alt=\"\" class=\"wp-image-609\" srcset=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/viola.jpg 687w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/viola-270x300.jpg 270w\" sizes=\"(max-width: 687px) 100vw, 687px\" \/><\/figure><\/div>\n\n\n<p><br>Edison Viola is being constructed at Block N of Bashundhara R\/A, right next to the lake. The gentle embrace of the lake to the south and southwest graces the apartments with an abundance of refreshing breeze. The 40-feet-wide front road enhances connectivity.&nbsp;<\/p>\n\n\n\n<p>Furthermore, this project is near the upcoming 200-feet DAP connecting road. This road will seamlessly link the 300-feet Purbachal Road and the 100-feet Madani Avenue. The Bashundhara Central Mosque is nearby. So, in a nutshell, the location of Viola offers a perfect blend of convenience and accessibility.<\/p>\n\n\n\n<p>Viola is designed by award winning consultant architect firm Cubeinside. It comprises 13 apartments ranging in size from 1,615 to 2,150 square feet. Positioned with two open sides, all 13 apartments offer stunning views of the lake. As you enter, you will be greeted by a beautiful gate, followed by a modern-designed driveway measuring 14 feet in width.&nbsp;<\/p>\n\n\n\n<p>The lift, lobby, stairs, and car parking areas are tastefully adorned, creating an inviting ambiance. Viola provides 14 parking spaces. One of the most captivating aspects of Viola is the abundance of greenery, almost 1,234 square feet in total, which not only enhances the aesthetic charms, but also infuses the environment with tranquillity.&nbsp;<\/p>\n\n\n\n<p>The rooftop will serve as an exceptional space for leisure activities. A dedicated Bar-B-Q Zone will be available for celebrating special occasions. On the ground floor, the green patio will provide a serene setting for children to play under the gentle afternoon sun. Viola&#8217;s welcoming atmosphere will foster a sense of togetherness and familiarity, allowing you to experience a warm and comfortable feeling. Undoubtedly, it offers a remarkable place to create cherished moments with loved ones. The project will be handed over in a mere 26 months, by September 2025.&nbsp;<\/p>\n\n\n\n<p>To know more about this lakeside creation, visit:&nbsp;<a href=\"https:\/\/edisonrealestatebd.com\/projects\/edison-viola\">https:\/\/edisonrealestatebd.com\/projects\/edison-viola<\/a><br><\/p>\n\n\n\n<p><strong>Edison Hermia&nbsp;<\/strong><\/p>\n\n\n\n<p>Introducing Edison Hermia, the most luxurious project in M Block of Bashundhara R\/A. Nestled amidst lakeside serenity, this modern marvel offers an unparalleled living experience. This exclusive project spans 9.33 katha beside a lakeside corner plot, with openness on two sides. It is one of the 140 lakeside plots in M block.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"687\" height=\"859\" src=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/hermia.jpg\" alt=\"\" class=\"wp-image-610\" srcset=\"https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/hermia.jpg 687w, https:\/\/edisonrealestatebd.com\/blog\/wp-content\/uploads\/2023\/09\/hermia-240x300.jpg 240w\" sizes=\"(max-width: 687px) 100vw, 687px\" \/><\/figure><\/div>\n\n\n<p><br>The project offers the tranquillity of fresh lake air with all the modern amenities, creating a uniquely beautiful home. Before Hermia lies a 25-feet-wide road. It has 13 apartments of 1,780 to 2,020 square feet. The project is surrounded by a delightful green oasis of almost 2,127 square feet.&nbsp;<\/p>\n\n\n\n<p>Edison Hermia has a lakeside seating area, perfect for embracing nature&#8217;s melody. A small, enchanting patio and a barbeque zone on the rooftop promise unforgettable evenings under the sky. And, to add practicality to the dreamscape, a convenient cloth drying area completes the picture. Like Viola, Hermia is also designed by award-winning architectural firm Cubeinside. In Hermia&#8217;s realm, every corner exudes a sense of wonder, and each day feels like a dream come true. The project will also be handed over within 26 months, by September 2025.<\/p>\n\n\n\n<p>Browse:&nbsp;<a href=\"https:\/\/edisonrealestatebd.com\/projects\/edison-Hermia\">https:\/\/edisonrealestatebd.com\/projects\/edison-Hermia<\/a>&nbsp;&nbsp;to know details about this beautiful creations.<br><\/p>\n\n\n\n<p>There is no denying that our life in Dhaka city is very mechanical. Unfortunately, this lifestyle badly affects both our physical and mental health. But the lakeside projects of Edison Real Estate offer you the opportunity to stay close to nature inside the city. Give your child a childhood to remember. And it might just be a call away. Dial 16760 for personalised response.<\/p>\n\n\n\n<p>Welcome to the dreamlike world of Edison Real Estate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dhaka — the city of millions. Here, years of mismanagement and uncontrolled population growth have resulted in an unplanned and unregulated housing system. However, amidst this chaos, a beacon of hope emerged in 2015 when Edison Real Estate started its journey.&nbsp; Within a few years, Edison has gained the trust of people, becoming the largest [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":611,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[8,25],"tags":[],"_links":{"self":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/606"}],"collection":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/comments?post=606"}],"version-history":[{"count":3,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/606\/revisions"}],"predecessor-version":[{"id":630,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/posts\/606\/revisions\/630"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/media\/611"}],"wp:attachment":[{"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/media?parent=606"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/categories?post=606"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/edisonrealestatebd.com\/blog\/wp-json\/wp\/v2\/tags?post=606"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}